const router = require('koa-router')()

router.get('/:id', ctx => {
  ctx.body = {
    data:[
      {
        id : "14_1523842140.14",
        target:{
          content : "<p>买台海外服务器，或者海外vps，内存不要太高，1g足矣，费用顶天了一个月100元可以搞定。</p><p><br></p><p>youtube开通过盈利功能，或者买别人开通过的账号，我了解的这边老外一个300刀左右，厦门有朋友通过渠道给我搞定，1000元一个账户，老外那边讨价还价下，应该可以250刀搞定，且算1800元，总共1900，然后编写个自动化采集爆文转化视频传youtube即可。</p><p><br></p><p>一个月前期100刀，第二个月可以跑到300刀，持续增加的状态。</p><p><br></p><p><br></p><p>想赚更多，就不停铺账号，不停复制下去。</p><p><br></p><p><br></p><p>几个核心。。。你会自己开发这种自动化的软件，然后就是自己需要明白什么样的内容不会被youtube说你涉嫌违规。</p><p><br></p><p><br></p><p>当然，这些我不会说，要做的话，自己积累下经验吧。想一本万利，自己多动脑。</p><p><br></p><p><br></p><p>3.22 补充</p><p><br></p><p>我一直没说做视频搬运，为什么那么多人不仔细看?</p><p><br></p><p>我也没说我卖账号，只是提了下了解到的账号价格。</p><p><br></p><p>非要逼逼我，有意思吗?自己没去操作就乱评价。</p>",
          excerpt : "买台海外服务器，或者海外vps，内存不要太高，1g足矣，费用顶天了一个月100元可以搞定。 youtube开通过盈利功能，或者买别人开通过的账号，我了解的这边老外一个300刀左右，厦门有朋友通过渠道给我搞定，1000元一个账户，老外那边讨价还价下，应该可以250刀搞定，且算1800元，总共1900，然后编写个自动化采集爆文转化视频传youtube即可。 一个月前期100刀，第二个月可以跑到300刀，持续增加的状态。 想赚更多，就不停铺账号，不…",
          excerpt_new : "买台海外服务器，或者海外vps，内存不要太高，1g足矣，费用顶天了一个月100元可以搞定。 youtube开通过盈利功能，或者买别人开通过的账号，我了解的这边老外一个300刀左右，厦门有朋友通过渠道给我搞定，1000元一个账户，老外那边讨价还价下，应该可以250刀搞定…",
          comment_count : 362,//评论数
          voteup_count : 2979,//赞成
          updated_time : 1521704531,
          author:{
            name:"冯意番",
            headline : "我就是要得意一番",
            url : "https://api.zhihu.com/people/7cfc95c3d54d07297fd506b9a1bf1325",
            avatar_url : "https://pic3.zhimg.com/50/fe9d83138_s.jpg",
          },
          question:{
            title : "成本 2000 元以内、不会令人良心不安的赚钱方法有哪些？",
            // 最新回复
            excerpt_new : "买台海外服务器，或者海外vps，内存不要太高，1g足矣，费用顶天了一个月100元可以搞定。 youtube开通过盈利功能，或者买别人开通过的账号，我了解的这边老外一个300刀左右，厦门有朋友通过渠道给我搞定，1000元一个账户，老外那边讨价还价下，应该可以250刀搞定…",

          }
        },
        actors:[
          {
            name:"创业",
            avatar_url : "https://pic4.zhimg.com/50/b75f995419ff775ff71fca685d7825af_s.jpg",
          }
        ],
        action_text_tpl : "来自话题: ",
      },
      {
        id : "14_1523842141.14",
        target:{
          content : "其实李小璐和PGone很配啊。<br>李小璐少年成名，十几岁就出来拍戏赚钱，正是上初中上高中的年纪，不上学，家里又特有钱，后来读的大学是个野鸡大学，正经大学逃课的也不少啊，她那学校的文凭谁知道怎么来的。PGone也差不多，高中没毕业。<br>吃瓜群众看他两是带着明星的光环，如果不把他两看成明星呢？<br>一个不好好读书的女生，家里条件不错，后来买了个学校，听父母话，找了个条件不错的人结了婚，生了孩子，老公对她挺好，结果她聊了个网友，出来见了面，网友高中没毕业，比不上她老公，但是有人看见她和网友开房去了……<br>有没有很合理？<br><br>～～～～～～～～～～～～～～～<br>哇，这么多赞，吓死我了。（｡ò ∀ ó｡）<br>随便写写，各位别较真。",
          excerpt : "其实李小璐和PGone很配啊。 李小璐少年成名，十几岁就出来拍戏赚钱，正是上初中上高中的年纪，不上学，家里又特有钱，后来读的大学是个野鸡大学，正经大学逃课的也不少啊，她那学校的文凭谁知道怎么来的。PGone也差不多，高中没毕业。 吃瓜群众看他两是带着明星的光环，如果不把他两看成明星呢？ 一个不好好读书的女生，家里条件不错，后来买了个学校，听父母话，找了个条件不错的人结了婚，生了孩子，老公对她挺好，结果她聊了…",
          excerpt_new : "其实李小璐和PGone很配啊。 李小璐少年成名，十几岁就出来拍戏赚钱，正是上初中上高中的年纪，不上学，家里又特有钱，后来读的大学是个野鸡大学，正经大学逃课的也不少啊，她那学校的文凭谁知道怎么来的。PGone也差不多，高中没毕业。 吃瓜群众看他两是带着明星…",
          comment_count : 453,//评论数
          voteup_count : 4770,//赞成
          updated_time : 1521704531,
          author:{
            name : "thenine",
            headline : "网名十年不换",
            url : "https://api.zhihu.com/people/fdf1404f8d2be11db5c208e52301c46f",
            avatar_url : "https://pic2.zhimg.com/50/43fc12ae7_s.jpg",
          },
          question:{
            title : "李小璐看上PG ONE 什么了？为什么会喜欢上他？",
            // 最新回复
            excerpt_new : "李小璐跟PG ONE 的事，李小璐喜欢PG ONE 什么了？把自己搞的很“嘻哈”就算了，也不至于出轨呀！"
          }
        },
        actors:[
          {
            name : "李小璐",
            avatar_url : "https://pic1.zhimg.com/50/v2-aa871469bed2f39160004d1514120ae8_s.jpg",
          }
        ],
        action_text_tpl : "热门内容, 来自",
      },
      {
        id : "14_1523842142.14",
        target:{
          content : "在欧洲（比利时的“农村”，有点以偏概全，这里纠正），别说三件套了，连西装都很少有人穿的。大家都是连帽卫衣套冲锋衣。恨不能穿这身衣服出现在任何场合。<br><br>所以你问，中国为啥很少有人穿三件套，我说，不是是中国，而是全世界穿西装的都是少数有身份的人走了（政客、大记者、巨商、高管之类的吧）。普通大众还是不太愿意把自己穿成自己并不属于的阶层。<br><br>虽然这样，但西装真的很好看。",
          excerpt : "在欧洲（比利时的“农村”，有点以偏概全，这里纠正），别说三件套了，连西装都很少有人穿的。大家都是连帽卫衣套冲锋衣。恨不能穿这身衣服出现在任何场合。 所以你问，中国为啥很少有人穿三件套，我说，不是是中国，而是全世界穿西装的都是少数有身份的人走了（政客、大记者、巨商、高管之类的吧）。普通大众还是不太愿意把自己穿成自己并不属于的阶层。 虽然这样，但西装真的很好看。",
          excerpt_new : "在欧洲（比利时的“农村”，有点以偏概全，这里纠正），别说三件套了，连西装都很少有人穿的。大家都是连帽卫衣套冲锋衣。恨不能穿这身衣服出现在任何场合。 所以你问，中国为啥很少有人穿三件套，我说，不是是中国，而是全世界穿西装的都是少数有身份的人走了…",
          comment_count : 161,//评论数
          voteup_count : 427,//赞成
          updated_time : 1521704831,
          author:{
            name : "鳴开朗奇罗",
            headline : "积极的悲观主义者",
            url : "https://api.zhihu.com/people/4fa1f867816edd30fc72780dfe660032",
            avatar_url : "https://pic2.zhimg.com/50/4e13fb46d_s.jpg",

          },
          question:{
            title : "为什么中国很少有人穿三件套西服？",
            // 最新回复
            excerpt_new : "即使很正式的场合，人民也就是穿一身上班的西服就赴宴了。为什么很少有人穿三件套，明明蛮好看的。就说大陆吧。"
          }
        },
        actors:[
          {
            name:"男装",
            avatar_url : "https://pic2.zhimg.com/50/c1247ba54_s.jpg"
          }
        ],
        action_text_tpl : "热门内容, 来自:"
      },
    ]
  }
})


module.exports = router
